{"weightsManifest": [{"paths": ["group1-shard1of24.bin", "group1-shard2of24.bin", "group1-shard3of24.bin", "group1-shard4of24.bin", "group1-shard5of24.bin", "group1-shard6of24.bin", "group1-shard7of24.bin", "group1-shard8of24.bin", "group1-shard9of24.bin", "group1-shard10of24.bin", "group1-shard11of24.bin", "group1-shard12of24.bin", "group1-shard13of24.bin", "group1-shard14of24.bin", "group1-shard15of24.bin", "group1-shard16of24.bin", "group1-shard17of24.bin", "group1-shard18of24.bin", "group1-shard19of24.bin", "group1-shard20of24.bin", "group1-shard21of24.bin", "group1-shard22of24.bin", "group1-shard23of24.bin", "group1-shard24of24.bin"], "weights": [{"dtype": "float32", "shape": [17, 100], "name": "dense_6/kernel"}, {"dtype": "float32", "shape": [100], "name": "dense_6/bias"}, {"dtype": "float32", "shape": [600, 21326], "name": "dense_8/kernel"}, {"dtype": "float32", "shape": [21326], "name": "dense_8/bias"}, {"dtype": "float32", "shape": [200, 4000], "name": "lstm_4/kernel"}, {"dtype": "float32", "shape": [1000, 4000], "name": "lstm_4/recurrent_kernel"}, {"dtype": "float32", "shape": [4000], "name": "lstm_4/bias"}, {"dtype": "float32", "shape": [1000, 2000], "name": "lstm_5/kernel"}, {"dtype": "float32", "shape": [500, 2000], "name": "lstm_5/recurrent_kernel"}, {"dtype": "float32", "shape": [2000], "name": "lstm_5/bias"}, {"dtype": "float32", "shape": [21326, 200], "name": "sequence_embedding_2/embeddings"}]}], "modelTopology": {"keras_version": "2.2.4-tf", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"ragged": false, "dtype": "float32", "batch_input_shape": [1, 29], "name": "input_6", "sparse": false}, "name": "input_6"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"ragged": false, "dtype": "float32", "batch_input_shape": [1, 17], "name": "input_5", "sparse": false}, "name": "input_5"}, {"class_name": "Embedding", "inbound_nodes": [[["input_6", 0, 0, {}]]], "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "sequence_embedding", "dtype": "float32", "output_dim": 200, "trainable": false, "embeddings_regularizer": null, "input_dim": 21326, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 29], "activity_regularizer": null, "input_length": 29}, "name": "sequence_embedding"}, {"class_name": "Dense", "inbound_nodes": [[["input_5", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_6", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 100, "use_bias": true, "activity_regularizer": null}, "name": "dense_6"}, {"class_name": "LSTM", "inbound_nodes": [[["sequence_embedding", 0, 0, {}]]], "config": {"recurrent_activation": "sigmoid", "dtype": "float32", "trainable": true, "recurrent_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1000, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_constraint": null, "time_major": false, "activation": "tanh", "stateful": true, "dropout": 0.0, "recurrent_regularizer": null, "name": "lstm_4", "bias_constraint": null, "go_backwards": false, "implementation": 2, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}, "name": "lstm_4"}, {"class_name": "Dropout", "inbound_nodes": [[["dense_6", 0, 0, {}]]], "config": {"name": "dropout_2", "dtype": "float32", "trainable": true, "rate": 0.1, "seed": null, "noise_shape": null}, "name": "dropout_2"}, {"class_name": "LSTM", "inbound_nodes": [[["lstm_4", 0, 0, {}]]], "config": {"recurrent_activation": "sigmoid", "dtype": "float32", "trainable": true, "recurrent_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 500, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_constraint": null, "time_major": false, "activation": "tanh", "stateful": true, "dropout": 0.0, "recurrent_regularizer": null, "name": "lstm_5", "bias_constraint": null, "go_backwards": false, "implementation": 2, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}, "name": "lstm_5"}, {"class_name": "RepeatVector", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "repeat_vector_2", "n": 29}, "name": "repeat_vector_2"}, {"class_name": "Concatenate", "inbound_nodes": [[["lstm_5", 0, 0, {}], ["repeat_vector_2", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "concatenate_2", "axis": 2}, "name": "concatenate_2"}, {"class_name": "Dense", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_8", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 21326, "use_bias": true, "activity_regularizer": null}, "name": "dense_8"}], "output_layers": [["dense_8", 0, 0]], "name": "model_8", "input_layers": [["input_6", 0, 0], ["input_5", 0, 0]]}}, "backend": "tensorflow"}, "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.7.4", "format": "layers-model"}