{"weightsManifest": [{"paths": ["group1-shard1of6.bin", "group1-shard2of6.bin", "group1-shard3of6.bin", "group1-shard4of6.bin", "group1-shard5of6.bin", "group1-shard6of6.bin"], "weights": [{"dtype": "float32", "shape": [17, 100], "name": "dense_3/kernel", "quantization": {"dtype": "uint8", "scale": 0.0494841126834645, "min": -5.443252395181094}}, {"dtype": "float32", "shape": [100], "name": "dense_3/bias", "quantization": {"dtype": "uint8", "scale": 0.02273863437129002, "min": -2.8878065651538325}}, {"dtype": "float32", "shape": [600, 21326], "name": "dense_5/kernel", "quantization": {"dtype": "uint8", "scale": 0.03800663293576708, "min": -4.712822484035118}}, {"dtype": "float32", "shape": [21326], "name": "dense_5/bias", "quantization": {"dtype": "uint8", "scale": 0.0012261913687575097, "min": -0.1618572606759913}}, {"dtype": "float32", "shape": [200, 4000], "name": "lstm_2/kernel", "quantization": {"dtype": "uint8", "scale": 0.020110379013360716, "min": -2.5942388927235323}}, {"dtype": "float32", "shape": [1000, 4000], "name": "lstm_2/recurrent_kernel", "quantization": {"dtype": "uint8", "scale": 0.013066466649373372, "min": -1.685574197769165}}, {"dtype": "float32", "shape": [4000], "name": "lstm_2/bias", "quantization": {"dtype": "uint8", "scale": 0.0043132234876062355, "min": -0.0603851288264873}}, {"dtype": "float32", "shape": [1000, 2000], "name": "lstm_3/kernel", "quantization": {"dtype": "uint8", "scale": 0.018434414209104053, "min": -2.212129705092486}}, {"dtype": "float32", "shape": [500, 2000], "name": "lstm_3/recurrent_kernel", "quantization": {"dtype": "uint8", "scale": 0.0151703815834195, "min": -1.9266384610942766}}, {"dtype": "float32", "shape": [2000], "name": "lstm_3/bias", "quantization": {"dtype": "uint8", "scale": 0.004201179012364032, "min": -0.04201179012364032}}, {"dtype": "float32", "shape": [21326, 200], "name": "sequence_embedding_1/embeddings", "quantization": {"dtype": "uint8", "scale": 0.0271149008881812, "min": -2.684375187929939}}]}], "modelTopology": {"keras_version": "2.2.4-tf", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"ragged": false, "dtype": "float32", "batch_input_shape": [12, 29], "name": "input_4", "sparse": false}, "name": "input_4"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"ragged": false, "dtype": "float32", "batch_input_shape": [12, 17], "name": "input_3", "sparse": false}, "name": "input_3"}, {"class_name": "Embedding", "inbound_nodes": [[["input_4", 0, 0, {}]]], "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "sequence_embedding", "dtype": "float32", "output_dim": 200, "trainable": false, "embeddings_regularizer": null, "input_dim": 21326, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 29], "activity_regularizer": null, "input_length": 29}, "name": "sequence_embedding"}, {"class_name": "Dense", "inbound_nodes": [[["input_3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_3", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "tanh", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 100, "use_bias": true, "activity_regularizer": null}, "name": "dense_3"}, {"class_name": "LSTM", "inbound_nodes": [[["sequence_embedding", 0, 0, {}]]], "config": {"recurrent_activation": "sigmoid", "dtype": "float32", "trainable": true, "recurrent_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1000, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_constraint": null, "time_major": false, "activation": "tanh", "stateful": true, "dropout": 0.0, "recurrent_regularizer": null, "name": "lstm_2", "bias_constraint": null, "go_backwards": false, "implementation": 2, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}, "name": "lstm_2"}, {"class_name": "Dropout", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "config": {"name": "dropout_1", "dtype": "float32", "trainable": true, "rate": 0.1, "seed": null, "noise_shape": null}, "name": "dropout_1"}, {"class_name": "LSTM", "inbound_nodes": [[["lstm_2", 0, 0, {}]]], "config": {"recurrent_activation": "sigmoid", "dtype": "float32", "trainable": true, "recurrent_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 500, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_constraint": null, "time_major": false, "activation": "tanh", "stateful": true, "dropout": 0.0, "recurrent_regularizer": null, "name": "lstm_3", "bias_constraint": null, "go_backwards": false, "implementation": 2, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}, "name": "lstm_3"}, {"class_name": "RepeatVector", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "repeat_vector_1", "n": 29}, "name": "repeat_vector_1"}, {"class_name": "Concatenate", "inbound_nodes": [[["lstm_3", 0, 0, {}], ["repeat_vector_1", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "concatenate_1", "axis": 2}, "name": "concatenate_1"}, {"class_name": "Dense", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_5", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 21326, "use_bias": true, "activity_regularizer": null}, "name": "dense_5"}], "output_layers": [["dense_5", 0, 0]], "name": "model_5", "input_layers": [["input_4", 0, 0], ["input_3", 0, 0]]}}, "backend": "tensorflow"}, "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.7.4", "format": "layers-model"}